[
    {
        "name": "Zero Two",
        "description": "Zero Two (ゼロツー, Zero Tsū) is the main heroine and deuteragonist of DARLING in the FRANXX. She is a human-klaxo sapien hybrid and a member of the APE Special Forces, primarily fighting on the front lines. As an elite Parasite with the codename \"002\", also known as the \"Partner Killer\", Zero Two had always accepted solitude due to her horns and Klaxosaur blood. Despite having no regard for human life or her own and being accustomed to fighting solo, she took interest in Hiro and offered an opportunity to pilot with her, making him her new partner and \"darling\". After Hiro was able to ride with her more than three times, the pair became the 13th Plantation's newest members, piloting the powerful FRANXX Strelizia. Over time, Zero Two developed romantic feelings towards Hiro. However, her determination to become fully human, along with Hiro's apparent fear of her increasing feral characteristics resulted in the couple briefly drifting apart. When their relationship as partners began to take a turn and slowly crumble,they realized their forgotten memories of their meeting during childhood. The two chose to sacrifice their lives in order to safeguard and ensure the survival of humankind.",
        "image_source": "https://cdn.donmai.us/original/34/05/3405175d424b42519a365fc2606a26f0.jpg",
        "url": "zero-two"
    },
    {
        "name": "Hiro",
        "description": "Hiro (ヒロ, Hiro) is the main protagonist of DARLING in the FRANXX. He was a Parasite with the codename \"016\" and was once known as a prodigy among the Children. However, he failed to synchronize with his partner Naomi and was considered nothing but a failure as a pilot. As a result, he did not know where he belonged and struggled to find his place in the world. However, upon being partnered and piloting with Zero Two, he became an official Parasite and found a new reason to live. Hiro and Zero Two were the newest members of the 13th Plantation, piloting a FRANXX called Strelizia. Over the time spent together he began to reproduce feelings of romance with Zero Two, and when their relationship as partners began to take a turn and slowly crumble, he reawakened his previous feelings during childhood with her, along with his current feelings of love. The two eventually began a relationship together before their demise. Although motivated to fulfil his duty as a parasite, he later makes it his purpose in life to free all the parasites from APE's control and he selflessly sacrifices his own life to protect his friends and the planet.",
        "image_source": "https://wallpapercrafter.com/th800/434612-Anime-Darling-in-the-FranXX-Phone-Wallpaper.jpg",
        "url": "hiro"
    },
    {
        "name": "Strelizia",
        "description": "Strelizia (ストレリチア, Sutorerichia) or Strelitzia is a custom-made FRANXX mecha. Its Pistil is always Zero Two. There had been many people who volunteered to be Strelizia's Stamen, but none survived in the long term. Known notable Stamens include Code 081, who was killed due to Zero Two's dangerous piloting; Mitsuru, who was too eager to prove himself and was traumatized after just one sortie in Strelizia and Hiro, who was the only one to survive more than three sorties in Strelizia. Thanks to this feat, Hiro was declared Strelizia's official Stamen.",
        "image_source": "https://wallpaperaccess.com/full/8364761.jpg",
        "url": "strelizia"
    },
    {
        "name": "Ichigo",
        "description": "Ichigo (イチゴ, Ichigo) is one of the main characters in DARLING in the FRANXX. She is a former Parasite with the codename \"015\" of the Thirteenth Plantation, where she was partnered in boy-girl pair with Goro to pilot a FRANXX called Delphinium. She was the official leader of Squad 13.Due to her feelings for Hiro, she struggles between her selfishness and her responsibilities as a leader. Out of the entire squad, she alienates Zero Two the most and almost succeeds in separating her from Hiro for good until she realizes Zero Two is the only one Hiro loves, which prompts her to give up on him for the sake of his happiness and she eventually finds a new love in Goro at the end of the series.",
        "image_source": "https://assets-jpcust.jwpsrv.com/thumbnails/739444sn-720.jpg",
        "url": "ichigo"
    },
    {
        "name": "Goro",
        "description": "Goro (ゴロー, Gorō) is one of the main characters in DARLING in the FRANXX series. He is a former Parasite with the codename \"056\" of Thirteenth Plantation, where he was partnered in boy-girl pair with Ichigo to pilot a FRANXX called Delphinium. As an optimist, Goro prefers to be open-minded and civil for the sake of avoiding conflicts, even restraining his feelings for Ichigo because of her feelings for Hiro, his best friend. Under duress, he will take over the role as the leader to ensure the stability and survival of the squad. ",
        "image_source": "https://i.pinimg.com/736x/f0/93/42/f09342c3fa021301a5c515f28669334e.jpg",
        "url": "goro"
    },
    {
        "name": "Delphinium",
        "description": "Delphinium (デルフィニウム, Derufiniumu) is a FRANXX from Thirteenth Plantation piloted by Ichigo and Goro. It is the leader of the FRANXX platoon of Thirteen Plantation. Delphinium has light blue eyes, with pinkish-red hair that covers her right eye, which is a reference to the straight razor-cut hair that covers Ichigo's right eye. Delphinium has three deep blue fins on the top of its head, and it has a white and pale blue helmet/head crest over it that covers its hair. The torso area of Delphinium is mainly pale blue with a red and orange crest on its upper chest, resembling a school uniform tie. The lower torso contains many shooters, colored white and deep blue, arranged in a skirt-like manner. There are two stripes on its left leg, one red and one blue, and its feet are designed to resemble pumps. Delphinium wields two spear-like swords called \"Envy Shop\", which contain the orange magma-energy it can use to defeat the Klaxosaurs' cores. While in stampede mode, Delphinium takes on a four-legged bestial form with the two spear-like swords turning into two tails. ",
        "image_source": "https://4.bp.blogspot.com/-itidJdam3vw/W1DexSfyEVI/AAAAAAAAfuE/gLoHIqCF8ks9R9H5y2sSR8er1itQPXMCQCLcBGAs/s1600/Darling-in-the-Franxx-Delphinium.jpg",
        "url": "delphinium"
    }
]